Revit 2027 API
BuiltInFailures.KeynoteFailures.MissKeynoteParameter Property
 No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MissKeynoteParameter { get; }
Public Shared ReadOnly Property MissKeynoteParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MissKeynoteParameter {
	FailureDefinitionId^ get ();
}
static member MissKeynoteParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeynoteFailures Class
Autodesk.Revit.DB Namespace